export function getActualPrice(shares) {
    // TODO:
    // Реализовать генерацию новых цен для списка акций.
    //
    // Функция принимает массив акций с их текущей стоимостью
    // и возвращает новый массив, содержащий обновленную цену
    // для каждой акции.
    //
    // Изменение цены должно имитировать работу биржи:
    // - цена изменяется случайным образом;
    // - изменение происходит относительно текущей цены;
    // - не допускается отрицательная стоимость;
    // - можно ограничить максимальный процент
    //   изменения за один тик
    //
    // Функция должна быть чистой:
    // - не изменять входные объекты;
    // - возвращать новые значения.
}