<script setup>
// TODO:
// Создать основное состояние приложения для хранения данных по акциям.
//
// Структура состояния должна содержать:
// - список акций;
// - текущую (актуальную) цену каждой акции;
// - историю изменения цены для каждой акции.
//
// Структуру придумай сам
//
// TODO:
// После инициализации приложения запустить механизм "биржевых тиков".
// Через фиксированный интервал (например, раз в 1-2 секунды)
// вызывать getActualPrice() из price.service.js.
//
// TODO:
// После получения новых цен:
// - обновить текущую цену каждой акции;
// - добавить новую запись в историю;
// - ограничить размер истории (например, хранить только последние 100 изменений).
//
// TODO:
// При размонтировании компонента остановить механизм тиков
// (очистить setInterval).
</script>

<template>
  <div></div>
</template>

<style scoped></style>
